{
  "brandId": "TRL",
  "version": "1.0",
  "description": "Help content for TRL brand. Add entries for any section ID to provide contextual help.",
  "content": [
    {
      "id": "attendance-employee-selector",
      "screen": "attendance",
      "section": "employee-selector",
      "title": "Employee Selector",
      "whatItIs": "Dropdown to choose which employee's attendance you want to view or edit.",
      "howToUse": "Click the dropdown to see all employees you have permission to access. Type to search by last name.",
      "howToUpdate": "Go to the Employees tab to add new employees or modify existing ones.",
      "position": "bottom",
      "order": 1
    },
    {
      "id": "attendance-year-selector",
      "screen": "attendance",
      "section": "year-selector",
      "title": "Year Selector",
      "whatItIs": "Choose which year's attendance records to display.",
      "howToUse": "Click the dropdown and select a different year to view historical records.",
      "howToUpdate": "The calendar automatically displays the selected year. Records are saved per year.",
      "position": "bottom",
      "order": 2
    },
    {
      "id": "attendance-grid",
      "screen": "attendance",
      "section": "attendance-grid",
      "title": "Attendance Calendar",
      "whatItIs": "The calendar grid showing all time entries for the selected employee throughout the year.",
      "howToUse": "Click any date cell to add or edit time entries. Single entries show the time code (e.g., 'V 8'), multiple entries show total hours with an asterisk (e.g., '*8.5'), A blue dot in the top right of a cell denotes that there is a note in that cell",
      "howToUpdate": "Click a cell to open the entry dialog where you can add, edit, or delete entries.",
      "position": "top",
      "order": 3
    },
    {
      "id": "attendance-balance-cards",
      "screen": "attendance",
      "section": "balance-cards",
      "title": "Balance Cards",
      "whatItIs": "Shows used hours vs. allocated hours for time-off codes. 'Used' is the sum of all attendance entries with that time code for the selected year. 'Total' comes from either default allocations, accrual calculations, or manual employee overrides.",
      "howToUse": "Click any card to see a detailed breakdown including allocation source, usage summary, and individual entries with dates. The modal explains exactly how hours were calculated.",
      "howToUpdate": "Balances update automatically as you add entries. Allocations can be customized per employee in the Employees tab using the clock icon.",
      "position": "top",
      "order": 4
    },
    {
      "id": "balance-floating-holiday",
      "screen": "attendance",
      "section": "balance-floating-holiday",
      "title": "Floating Holiday Balance",
      "whatItIs": "Shows remaining floating holiday hours. Calculated as: Allocated Hours - Used Hours. Allocation may come from company defaults, accrual rules, or employee overrides.",
      "howToUse": "Click the card to see how many hours you've used, your allocation source, and a list of all FH entries by date.",
      "howToUpdate": "Add FH entries on the attendance calendar to use floating holidays. Allocations can be set per employee in the Employees tab.",
      "position": "top",
      "order": 5
    },
    {
      "id": "balance-personal-sick",
      "screen": "attendance",
      "section": "balance-personal-sick",
      "title": "Personal Sick Balance",
      "whatItIs": "Shows remaining personal sick hours. Calculated as: Allocated Hours - Used Hours. May be based on accrual (hours earned per hours worked) or fixed allocation.",
      "howToUse": "Click the card to see your allocation details, usage limits, and a list of all PS entries by date.",
      "howToUpdate": "Add PS entries on the attendance calendar to use personal sick time. Hours accrue or are allocated based on company policy.",
      "position": "top",
      "order": 6
    },
    {
      "id": "balance-vacation",
      "screen": "attendance",
      "section": "balance-vacation",
      "title": "Vacation Balance",
      "whatItIs": "Shows total vacation hours used this year. Vacation allocation may be based on years of service, employment type, or fixed company policy.",
      "howToUse": "Click the card to see your vacation tier (if applicable), allocation details, and a list of all V entries by date.",
      "howToUpdate": "Add V entries on the attendance calendar to record vacation time. Allocations may change based on your seniority.",
      "position": "top",
      "order": 7
    },
    {
      "id": "balance-holiday",
      "screen": "attendance",
      "section": "balance-holiday",
      "title": "Holiday Hours",
      "whatItIs": "Total paid holiday hours recorded for the year. This shows usage only - there is no allocation limit for paid holidays.",
      "howToUse": "Click the card to see a list of all holiday entries with dates and notes.",
      "howToUpdate": "Add H (Holiday) entries on the attendance calendar when you take paid holidays.",
      "position": "top",
      "order": 8
    },
    {
      "id": "entry-time-code",
      "screen": "attendance",
      "section": "entry-time-code",
      "title": "Time Code",
      "whatItIs": "The type of time being recorded (e.g., Vacation, Sick, Holiday).",
      "howToUse": "Select a time code from the dropdown. Choose '-' to clear the entry.",
      "howToUpdate": "Time codes are configured by administrators. Contact your admin to add new codes.",
      "position": "right",
      "order": 10
    },
    {
      "id": "entry-time",
      "screen": "attendance",
      "section": "entry-time",
      "title": "Hours & Minutes",
      "whatItIs": "The duration of time off being recorded.",
      "howToUse": "Use + and - buttons to adjust hours and minutes. Minutes increment in 15-minute intervals. Total hours for a day cannot exceed 24. Multiple entries on the same day are summed.",
      "howToUpdate": "When you are done adjusting time click 'Save All Changes' and it will automatically update the date cell with all of the entered hours and update the balance cards with the used hours.",
      "position": "right",
      "order": 11
    },
    {
      "id": "entry-notes",
      "screen": "attendance",
      "section": "entry-notes",
      "title": "Notes",
      "whatItIs": "Optional text to provide context for this entry.",
      "howToUse": "Add notes like 'doctor appointment' or 'PTO'. Notes are visible to managers.",
      "howToUpdate": "Edit the text field directly. Notes are saved when you click 'Save All Changes'.",
      "position": "right",
      "order": 12
    },
    {
      "id": "employees-add-button",
      "screen": "employees",
      "section": "add-employee",
      "title": "Add Employee",
      "whatItIs": "Button to create a new employee record in the system.",
      "howToUse": "Click to open a form for entering new employee information.",
      "howToUpdate": "Fill out required fields (name, employee number, group) and click 'Create Employee'.",
      "position": "left",
      "order": 1
    },
    {
      "id": "employees-edit",
      "screen": "employees",
      "section": "edit-employee",
      "title": "Edit Employee",
      "whatItIs": "Opens the employee edit dialog to modify their information.",
      "howToUse": "Click the pencil icon to edit employee details like name, email, group, and hire date.",
      "howToUpdate": "Make changes in the dialog and click 'Update Employee' to save.",
      "position": "left",
      "order": 2
    },
    {
      "id": "employees-allocations",
      "screen": "employees",
      "section": "allocations",
      "title": "Time Allocations",
      "whatItIs": "Custom time-off hours allocated to this employee per year.",
      "howToUse": "Click the clock icon to view and set annual time-off allocations.",
      "howToUpdate": "Enter custom hours for each time-off type, or leave blank to use group defaults. Each change has to be saved by clicking the save button to the right of the changed allocated hours before changing another allocation.",
      "position": "left",
      "order": 3
    },
    {
      "id": "employees-delete",
      "screen": "employees",
      "section": "delete-employee",
      "title": "Deactivate Employee",
      "whatItIs": "Marks the employee as inactive (soft delete). Their records are preserved.",
      "howToUse": "Click the trash icon to deactivate. A confirmation dialog will appear.",
      "howToUpdate": "Superusers can view inactive employees by clicking 'Show Inactive'. Reactivation requires database access.",
      "position": "left",
      "order": 4
    },
    {
      "id": "users-add",
      "screen": "users",
      "section": "add-user",
      "title": "Add User",
      "whatItIs": "Creates a new system user account.",
      "howToUse": "Click to open a form for entering new user credentials and permissions.",
      "howToUpdate": "Fill out username, password, full name, group, and role, then click Create.",
      "position": "left",
      "order": 1
    },
    {
      "id": "users-edit",
      "screen": "users",
      "section": "edit-user",
      "title": "Edit User",
      "whatItIs": "Opens the user edit dialog to modify account information.",
      "howToUse": "Click the pencil icon to edit user details like name, email, group, and role.",
      "howToUpdate": "Make changes in the dialog and click 'Update User'. Leave password blank to keep current.",
      "position": "left",
      "order": 2
    },
    {
      "id": "users-permissions",
      "screen": "users",
      "section": "permissions",
      "title": "Group Permissions",
      "whatItIs": "Controls which employee groups this user can access and what actions they can perform.",
      "howToUse": "Click the shield icon to open the permissions dialog.",
      "howToUpdate": "Check or uncheck Create, Read, Update, Delete permissions for each employee group.",
      "position": "left",
      "order": 3
    },
    {
      "id": "users-delete",
      "screen": "users",
      "section": "delete-user",
      "title": "Deactivate User",
      "whatItIs": "Marks the user as inactive (soft delete). They can no longer log in.",
      "howToUse": "Click the trash icon to deactivate. A confirmation dialog will appear.",
      "howToUpdate": "Reactivation requires database access. Use 'Show Inactive' to view deactivated users.",
      "position": "left",
      "order": 4
    },
    {
      "id": "settings-color-mode",
      "screen": "settings",
      "section": "color-mode",
      "title": "Color Mode",
      "whatItIs": "Controls the color scheme of the application (light, dark, or system).",
      "howToUse": "Select Light for always bright, Dark for always dark, or System to match your device settings.",
      "howToUpdate": "Changes apply immediately and are saved to your browser.",
      "position": "right",
      "order": 1
    },
    {
      "id": "settings-layout-theme",
      "screen": "settings",
      "section": "layout-theme",
      "title": "Layout Theme",
      "whatItIs": "Admin-only setting that controls layout density, typography, and spacing for all users.",
      "howToUse": "Select a theme from the dropdown to change the overall layout style.",
      "howToUpdate": "Changes apply immediately to all users. This setting does not affect colors.",
      "position": "right",
      "order": 2
    },
    {
      "id": "settings-backup",
      "screen": "settings",
      "section": "backup",
      "title": "Backup Management",
      "whatItIs": "Create, restore, and manage database backups.",
      "howToUse": "View backup history, create manual backups, or restore from a previous backup.",
      "howToUpdate": "Backups are created automatically. Click 'Create Backup' for manual backup.",
      "position": "top",
      "order": 3
    },
    {
      "id": "dashboard-stats-cards",
      "screen": "dashboard",
      "section": "stats-cards",
      "title": "Statistics Overview",
      "whatItIs": "Quick summary cards showing key metrics: total employees, entries, hours logged, and time codes used.",
      "howToUse": "View at-a-glance statistics for the system. Numbers update as attendance entries are added.",
      "howToUpdate": "Stats are calculated automatically from attendance data. Add entries on the Attendance page.",
      "position": "bottom",
      "order": 1
    },
    {
      "id": "dashboard-time-code-usage",
      "screen": "dashboard",
      "section": "time-code-usage",
      "title": "Time Code Usage",
      "whatItIs": "Breakdown of hours logged by time code type (Vacation, Sick, Holiday, etc.).",
      "howToUse": "View which time codes are used most frequently and their total hours.",
      "howToUpdate": "Data updates automatically as attendance entries are added or modified.",
      "position": "right",
      "order": 2
    },
    {
      "id": "dashboard-employee-summary",
      "screen": "dashboard",
      "section": "employee-summary",
      "title": "Employee Summary",
      "whatItIs": "List of employees with their total entry count and hours logged.",
      "howToUse": "View which employees have the most time-off entries and hours.",
      "howToUpdate": "Data updates automatically. Click an employee to go to their attendance page.",
      "position": "left",
      "order": 3
    },
    {
      "id": "dashboard-recent-entries",
      "screen": "dashboard",
      "section": "recent-entries",
      "title": "Recent Entries",
      "whatItIs": "The 10 most recent attendance entries across all employees.",
      "howToUse": "Quickly see the latest time-off entries that have been logged.",
      "howToUpdate": "Entries appear here automatically when added on the Attendance page.",
      "position": "top",
      "order": 4
    },
    {
      "id": "reports-filters",
      "screen": "reports",
      "section": "report-filters",
      "title": "Report Filters",
      "whatItIs": "Filter controls to narrow down the attendance data included in your report.",
      "howToUse": "Select employee, time code, and date range, then click 'Generate Report'.",
      "howToUpdate": "Filters are not saved between sessions. Set them each time you generate a report.",
      "position": "bottom",
      "order": 1
    },
    {
      "id": "reports-generate",
      "screen": "reports",
      "section": "generate-report",
      "title": "Generate Report",
      "whatItIs": "Button to fetch and display attendance data based on your filter selections.",
      "howToUse": "Set your filters, then click this button to populate the results table.",
      "howToUpdate": "Click again after changing filters to refresh the results.",
      "position": "top",
      "order": 2
    },
    {
      "id": "reports-export",
      "screen": "reports",
      "section": "export-csv",
      "title": "Export CSV",
      "whatItIs": "Downloads the current report data as a CSV file for use in Excel or other tools.",
      "howToUse": "After generating a report, click this button to download the data.",
      "howToUpdate": "Generate a new report first if you want updated data in your export.",
      "position": "top",
      "order": 3
    },
    {
      "id": "reports-results",
      "screen": "reports",
      "section": "report-results",
      "title": "Report Results",
      "whatItIs": "Table showing attendance entries that match your filter criteria.",
      "howToUse": "Review the data, scroll to see all entries. Export to CSV for further analysis.",
      "howToUpdate": "Click 'Generate Report' with new filters to refresh the data.",
      "position": "top",
      "order": 4
    },
    {
      "id": "entry-add-another",
      "screen": "attendance",
      "section": "entry-add-another",
      "title": "Add New Entry",
      "whatItIs": "Button to create another entry allowing you split the hours used by multiple time codes.",
      "howToUse": "Click 'Add Another Entry' and a new entry box will be added below the first one. If you want to remove an entry box select the red trashcan in the top right of the entry.",
      "howToUpdate": "When you click 'Save All Changes' it will add up the total hours used and display that in the date cell denoted with an asterisk to show it has multiple entries.",
      "position": "right",
      "order": 13
    },
    {
      "id": "settings-groups",
      "screen": "settings",
      "section": "groups-management",
      "title": "Groups Management",
      "whatItIs": "Create and manage employee groups used to organize employees and control data visibility.",
      "howToUse": "View all groups in the table. Use 'Add Group' to create new groups, or click the pencil/trash icons to edit or delete existing groups.",
      "howToUpdate": "Changes take effect immediately. Groups with employees cannot be deleted until those employees are reassigned.",
      "position": "top",
      "order": 4
    },
    {
      "id": "settings-groups-add",
      "screen": "settings",
      "section": "groups-add",
      "title": "Add Group",
      "whatItIs": "Button to create a new employee group.",
      "howToUse": "Click to open a form where you enter the group name, optional description, and permission settings.",
      "howToUpdate": "Fill out the form and click 'Create Group'. The new group will appear in the table immediately.",
      "position": "left",
      "order": 5
    },
    {
      "id": "settings-groups-edit",
      "screen": "settings",
      "section": "groups-edit",
      "title": "Edit Group",
      "whatItIs": "Opens a dialog to modify an existing group's settings.",
      "howToUse": "Click the pencil icon next to any group to edit its name, description, or permissions.",
      "howToUpdate": "Make changes and click 'Save Changes'. Master groups have restricted permission editing.",
      "position": "left",
      "order": 6
    },
    {
      "id": "settings-groups-delete",
      "screen": "settings",
      "section": "groups-delete",
      "title": "Delete Group",
      "whatItIs": "Permanently removes a group from the system.",
      "howToUse": "Click the trash icon next to a group. A confirmation dialog will appear showing if any employees are assigned.",
      "howToUpdate": "Confirm deletion to remove the group. Master groups cannot be deleted.",
      "position": "left",
      "order": 7
    },
    {
      "id": "settings-groups-permissions",
      "screen": "settings",
      "section": "groups-permissions",
      "title": "Group Permissions",
      "whatItIs": "Controls what members of this group can see and edit across the system.",
      "howToUse": "'View All' lets members see employees from all groups. 'Edit All' lets members edit employees from all groups.",
      "howToUpdate": "Toggle permissions when creating or editing a group. Master groups automatically have full access.",
      "position": "top",
      "order": 8
    },
    {
      "id": "settings-job-titles",
      "screen": "settings",
      "section": "job-titles-management",
      "title": "Job Titles",
      "whatItIs": "Define standardized job titles that can be assigned to employees instead of free-text roles.",
      "howToUse": "View all job titles in the table. Use 'Add Job Title' to create new titles, or click the pencil/trash icons to edit or delete.",
      "howToUpdate": "Changes take effect immediately. Job titles assigned to employees will persist even if the title is later deleted.",
      "position": "top",
      "order": 9
    },
    {
      "id": "settings-job-titles-add",
      "screen": "settings",
      "section": "job-titles-add",
      "title": "Add Job Title",
      "whatItIs": "Button to create a new job title for employee assignment.",
      "howToUse": "Click to open a form where you enter the title name, optional description, and active status.",
      "howToUpdate": "Fill out the form and click 'Create Job Title'. The new title will be available for employee assignment.",
      "position": "left",
      "order": 10
    },
    {
      "id": "settings-job-titles-edit",
      "screen": "settings",
      "section": "job-titles-edit",
      "title": "Edit Job Title",
      "whatItIs": "Opens a dialog to modify an existing job title.",
      "howToUse": "Click the pencil icon next to any job title to edit its name, description, or active status.",
      "howToUpdate": "Make changes and click 'Save Changes'. Existing employee assignments will remain unchanged.",
      "position": "left",
      "order": 11
    },
    {
      "id": "settings-job-titles-delete",
      "screen": "settings",
      "section": "job-titles-delete",
      "title": "Delete Job Title",
      "whatItIs": "Permanently removes a job title from the system.",
      "howToUse": "Click the trash icon next to a job title. A confirmation dialog will appear.",
      "howToUpdate": "Confirm deletion to remove the title. Employees currently assigned this title will keep it as text.",
      "position": "left",
      "order": 12
    },
    {
      "id": "settings-job-titles-status",
      "screen": "settings",
      "section": "job-titles-status",
      "title": "Job Title Status",
      "whatItIs": "Indicates whether a job title is available for assignment to new employees.",
      "howToUse": "Active titles appear in dropdown menus when editing employees. Inactive titles are hidden but preserved.",
      "howToUpdate": "Toggle the 'Active' switch when creating or editing a job title to change its availability.",
      "position": "top",
      "order": 13
    }
  ]
}
